Hector93/minisumo-stm32/Application/Src/imu.c
#include "stm32f1xx.h"
#include "imu.h"
#include "usart.h"
#include "i2c.h"
#include "FreeRTOS.h"

#include "inv_mpu.h"
#include "inv_mpu_dmp_motion_driver.h"
#include "invensense.h"
#include "invensense_adv.h"
#include "eMPL_outputs.h"
#include "mltypes.h"
#include "mpu.h"
#include "log.h"
#include "packet.h"

#include <string.h>
#include "message.h"
unsigned char *dmp_memory;

/* Private typedef -----------------------------------------------------------*/
/* Data read from MPL. */
#define PRINT_ACCEL     (0x01)
#define PRINT_GYRO      (0x02)
#define PRINT_QUAT      (0x04)
#define PRINT_COMPASS   (0x08)
#define PRINT_EULER     (0x10)
#define PRINT_ROT_MAT   (0x20)
#define PRINT_HEADING   (0x40)
#define PRINT_PEDO      (0x80)
#define PRINT_LINEAR_ACCEL (0x100)
#define PRINT_GRAVITY_VECTOR (0x200)

volatile uint32_t hal_timestamp = 0;
#define ACCEL_ON        (0x01)
#define GYRO_ON         (0x02)
#define COMPASS_ON      (0x04)

#define MOTION          (0)
#define NO_MOTION       (1)

/* Starting sampling rate. */
#define DEFAULT_MPU_HZ  (20)

#define FLASH_SIZE      (512)
#define FLASH_MEM_START ((void*)0x1800)

#define PEDO_READ_MS    (1000)
#define TEMP_READ_MS    (500)
#define COMPASS_READ_MS (100)
struct rx_s {
  unsigned char header[3];
  unsigned char cmd;
};
struct hal_s {
  unsigned char lp_accel_mode;
  unsigned char sensors;
  unsigned char dmp_on;
  unsigned char wait_for_tap;
  volatile unsigned char new_gyro;
  unsigned char motion_int_mode;
  unsigned long no_dmp_hz;
  unsigned long next_pedo_ms;
  unsigned long next_temp_ms;
  unsigned long next_compass_ms;
  unsigned int report;
  unsigned short dmp_features;
  struct rx_s rx;
};
static struct hal_s hal = {0};

/* USB RX binary semaphore. Actually, it's just a flag. Not included in struct
 * because it's declared extern elsewhere.
 */
volatile unsigned char rx_new;

unsigned char *mpl_key = (unsigned char*)"eMPL 5.1";

/* Platform-specific information. Kinda like a boardfile. */
struct platform_data_s {
  signed char orientation[9];
};

/* The sensors can be mounted onto the board in any orientation. The mounting
 * matrix seen below tells the MPL how to rotate the raw data from the
 * driver(s).
 * TODO: The following matrices refer to the configuration on internal test
 * boards at Invensense. If needed, please modify the matrices to match the
 * chip-to-body matrix for your particular set up.
 */
static struct platform_data_s gyro_pdata = {
					    .orientation = { 1, 0, 0,
							     0, 1, 0,
							     0, 0, 1}
};

#if defined MPU9150 || defined MPU9250
static struct platform_data_s compass_pdata = {
					       .orientation = { 0, 1, 0,
								1, 0, 0,
								0, 0, -1}
};
#define COMPASS_ENABLED 1
#elif defined AK8975_SECONDARY
static struct platform_data_s compass_pdata = {
					       .orientation = {-1, 0, 0,
							       0, 1, 0,
							       0, 0,-1}
};
#define COMPASS_ENABLED 1
#elif defined AK8963_SECONDARY
static struct platform_data_s compass_pdata = {
					       .orientation = {-1, 0, 0,
							       0,-1, 0,
							       0, 0, 1}
};
#define COMPASS_ENABLED 1
#endif


/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* ---------------------------------------------------------------------------*/
/* Get data from MPL.
 * TODO: Add return values to the inv_get_sensor_type_xxx APIs to differentiate
 * between new and stale data.
 */
static void read_from_mpl(void)
{
  long msg, data[9];
  int8_t accuracy;
  unsigned long timestamp;
  float float_data[3] = {0};

  if (inv_get_sensor_type_quat(data, &accuracy, (inv_time_t*)&timestamp)) {
    /* Sends a quaternion packet to the PC. Since this is used by the Python
     * test app to visually represent a 3D quaternion, it's sent each time
     * the MPL has new data.
     */
    eMPL_send_quat(data);

    /* Specific data packets can be sent or suppressed using USB commands. */
    if (hal.report & PRINT_QUAT)
      eMPL_send_data(PACKET_DATA_QUAT, data);
  }

  if (hal.report & PRINT_ACCEL) {
    if (inv_get_sensor_type_accel(data, &accuracy,
				  (inv_time_t*)&timestamp))
      eMPL_send_data(PACKET_DATA_ACCEL, data);
  }
  if (hal.report & PRINT_GYRO) {
    if (inv_get_sensor_type_gyro(data, &accuracy,
				 (inv_time_t*)&timestamp))
      eMPL_send_data(PACKET_DATA_GYRO, data);
  }
#ifdef COMPASS_ENABLED
  if (hal.report & PRINT_COMPASS) {
    if (inv_get_sensor_type_compass(data, &accuracy,
				    (inv_time_t*)&timestamp))
      eMPL_send_data(PACKET_DATA_COMPASS, data);
  }
#endif
  if (hal.report & PRINT_EULER) {
    if (inv_get_sensor_type_euler(data, &accuracy,
				  (inv_time_t*)&timestamp))
      eMPL_send_data(PACKET_DATA_EULER, data);
  }
  if (hal.report & PRINT_ROT_MAT) {
    if (inv_get_sensor_type_rot_mat(data, &accuracy,
				    (inv_time_t*)&timestamp))
      eMPL_send_data(PACKET_DATA_ROT, data);
  }
  if (hal.report & PRINT_HEADING) {
    if (inv_get_sensor_type_heading(data, &accuracy,
				    (inv_time_t*)&timestamp))
      eMPL_send_data(PACKET_DATA_HEADING, data);
  }
  if (hal.report & PRINT_LINEAR_ACCEL) {
    if (inv_get_sensor_type_linear_acceleration(float_data, &accuracy, (inv_time_t*)&timestamp)) {
      MPL_LOGI("Linear Accel: %7.5f %7.5f %7.5f\r\n",
	       float_data[0], float_data[1], float_data[2]);                                        
    }
  }
  if (hal.report & PRINT_GRAVITY_VECTOR) {
    if (inv_get_sensor_type_gravity(float_data, &accuracy,
				    (inv_time_t*)&timestamp))
      MPL_LOGI("Gravity Vector: %7.5f %7.5f %7.5f\r\n",
	       float_data[0], float_data[1], float_data[2]);
  }
  if (hal.report & PRINT_PEDO) {
    unsigned long timestamp;
    get_tick_count(&timestamp);
    if (timestamp > hal.next_pedo_ms) {
      hal.next_pedo_ms = timestamp + PEDO_READ_MS;
      unsigned long step_count, walk_time;
      dmp_get_pedometer_step_count(&step_count);
      dmp_get_pedometer_walk_time(&walk_time);
      MPL_LOGI("Walked %ld steps over %ld milliseconds..\n", step_count,
	       walk_time);
    }
  }

  /* Whenever the MPL detects a change in motion state, the application can
   * be notified. For this example, we use an LED to represent the current
   * motion state.
   */
   msg = inv_get_message_level_0(INV_MSG_MOTION_EVENT |
				 INV_MSG_NO_MOTION_EVENT);
   /*  if (msg) {
       if (msg & INV_MSG_MOTION_EVENT) {
       MPL_LOGI("Motion!\n");
       } else if (msg & INV_MSG_NO_MOTION_EVENT) {
       MPL_LOGI("No motion!\n");
       }
       }*/
}

#ifdef COMPASS_ENABLED
void send_status_compass() {
  long data[3] = { 0 };
  int8_t accuracy = { 0 };
  unsigned long timestamp;
  inv_get_compass_set(data, &accuracy, (inv_time_t*) &timestamp);
  MPL_LOGI("Compass: %7.4f %7.4f %7.4f ",
	   data[0]/65536.f, data[1]/65536.f, data[2]/65536.f);
  MPL_LOGI("Accuracy= %d\r\n", accuracy);

