Hector93/minisumo-stm32/Application/Src/imu.c
  //  xSemaphoreGive(I2cSemHandle);
  //xSemaphoreGive(I2cSemTxHandle);

 
  HAL_GPIO_TogglePin(led_GPIO_Port,led_Pin);
  result = mpu_init(&int_param);
  if (result != 0) {
    MPL_LOGE("Could not initialize gyro.\n");
  }
  result = inv_init_mpl();
  if (result != INV_SUCCESS) {
    MPL_LOGE("Could not initialize MPL.\n");
  }
  if(inv_enable_quaternion() != INV_SUCCESS){
    MPL_LOGE("Could not quaternion.\n");
  }
  if(inv_enable_9x_sensor_fusion() != INV_SUCCESS){
    MPL_LOGE("Could not enable 9x sensor fusion.\n");
  }
  if(inv_enable_fast_nomot() != INV_SUCCESS){
    MPL_LOGE("Could not enable fast nomot.\n");
  }
  if(inv_enable_gyro_tc() != INV_SUCCESS){
    MPL_LOGE("Could not enable gyro tc.\n");
  }  
  
#ifdef COMPASS_ENABLED
  /* Compass calibration algorithms. */
  inv_enable_vector_compass_cal();
  inv_enable_magnetic_disturbance();
#endif
  /* Allows use of the MPL APIs in read_from_mpl. */
  inv_enable_eMPL_outputs();
  result = inv_start_mpl();
  if (result == INV_ERROR_NOT_AUTHORIZED) {
    while (1) {
      MPL_LOGE("Not authorized.\n");
    }
  }
  if (result) {
    MPL_LOGE("Could not start the MPL.\n");
  }
#ifdef COMPASS_ENABLED
  mpu_set_sensors(INV_XYZ_GYRO | INV_XYZ_ACCEL | INV_XYZ_COMPASS);
#else
  mpu_set_sensors(INV_XYZ_GYRO | INV_XYZ_ACCEL);
#endif
  /* Push both gyro and accel data into the FIFO. */
  mpu_configure_fifo(INV_XYZ_GYRO | INV_XYZ_ACCEL);
  mpu_set_sample_rate(DEFAULT_MPU_HZ);
#ifdef COMPASS_ENABLED
  /* The compass sampling rate can be less than the gyro/accel sampling rate.
   * Use this function for proper power management.
   */
  mpu_set_compass_sample_rate(1000 / COMPASS_READ_MS);
#endif
  mpu_get_sample_rate(&gyro_rate);
  mpu_get_gyro_fsr(&gyro_fsr);
  mpu_get_accel_fsr(&accel_fsr);
#ifdef COMPASS_ENABLED
  mpu_get_compass_fsr(&compass_fsr);
#endif
  /* Sync driver configuration with MPL. */
  /* Sample rate expected in microseconds. */
  inv_set_gyro_sample_rate(1000000L / gyro_rate);
  inv_set_accel_sample_rate(1000000L / gyro_rate);
#ifdef COMPASS_ENABLED
  /* The compass rate is independent of the gyro and accel rates. As long as
   * inv_set_compass_sample_rate is called with the correct value, the 9-axis
   * fusion algorithm's compass correction gain will work properly.
   */
  inv_set_compass_sample_rate(COMPASS_READ_MS * 1000L);
#endif
  /* Set chip-to-body orientation matrix.
   * Set hardware units to dps/g's/degrees scaling factor.
   */
  inv_set_gyro_orientation_and_scale(
				     inv_orientation_matrix_to_scalar(gyro_pdata.orientation),
				     (long)gyro_fsr<<15);
  inv_set_accel_orientation_and_scale(
				      inv_orientation_matrix_to_scalar(gyro_pdata.orientation),
				      (long)accel_fsr<<15);
#ifdef COMPASS_ENABLED
  inv_set_compass_orientation_and_scale(
					inv_orientation_matrix_to_scalar(compass_pdata.orientation),
					(long)compass_fsr<<15);
#endif
#ifdef COMPASS_ENABLED
  hal.sensors = ACCEL_ON | GYRO_ON | COMPASS_ON;
#else
  hal.sensors = ACCEL_ON | GYRO_ON;
#endif
  hal.dmp_on = 0;
  hal.report = 0;
  hal.rx.cmd = 0;
  hal.next_pedo_ms = 0;
  hal.next_compass_ms = 0;
  hal.next_temp_ms = 0;
  /* Compass reads are handled by scheduler. */
  get_tick_count(&timestamp);
 
  //cargo dmp
  //  dmp_memory = malloc(sizeof(unsigned char) * 3062);
  dmp_memory = pvPortMalloc(sizeof(unsigned char) * 3062);
  dmp_memory[0]=0;
  //if(HAL_OK == (HAL_I2C_IsDeviceReady(&hi2c1,0x50 << 1,15,1000))){
  Sensors_I2C_WriteRegister(0x50,0,1,dmp_memory);
  //    HAL_I2C_Mem_Write(&hi2c1,0x50 << 1,0,sizeof(uint8_t),dmp_memory,1,10000);
  //}
  //if(HAL_OK == (HAL_I2C_IsDeviceReady(&hi2c1,0x50 << 1,15,1000))){
  //  Sensors_I2C_ReadRegister(0x50,0,(unsigned int)3062,dmp_memory);
  //  HAL_I2C_Mem_Read(&hi2c1,0x50 << 1,0,sizeof(uint8_t),dmp_memory,3062,100000);
  HAL_I2C_Master_Receive(&hi2c1, 0x50 << 1, dmp_memory, 3062, 1000000);
  //}
  
  if(!dmp_load_motion_driver_firmware()){
    HAL_GPIO_TogglePin(led_GPIO_Port,led_Pin);
  }
  vPortFree(dmp_memory);
  //  free(dmp_memory);
  if(!dmp_set_orientation(inv_orientation_matrix_to_scalar(gyro_pdata.orientation))){
    HAL_GPIO_TogglePin(led_GPIO_Port,led_Pin);
  }
  if(!dmp_register_tap_cb(tap_cb)){
    HAL_GPIO_TogglePin(led_GPIO_Port,led_Pin); 
  }
  if(!dmp_register_android_orient_cb(android_orient_cb)){
    HAL_GPIO_TogglePin(led_GPIO_Port,led_Pin);  
  }
  
  /*
   * Known Bug -
   * DMP when enabled will sample sensor data at 200Hz and output to FIFO at the rate
   * specified in the dmp_set_fifo_rate API. The DMP will then sent an interrupt once
   * a sample has been put into the FIFO. Therefore if the dmp_set_fifo_rate is at 25Hz
   * there will be a 25Hz interrupt from the MPU device.
   *
   * There is a known issue in which if you do not enable DMP_FEATURE_TAP
   * then the interrupts will be at 200Hz even if fifo rate
   * is set at a different rate. To avoid this issue include the DMP_FEATURE_TAP
   *
   * DMP sensor fusion works only with gyro at +-2000dps and accel +-2G
   */
  hal.dmp_features = DMP_FEATURE_6X_LP_QUAT | DMP_FEATURE_TAP |
    DMP_FEATURE_ANDROID_ORIENT | DMP_FEATURE_SEND_RAW_ACCEL | DMP_FEATURE_SEND_CAL_GYRO |
    DMP_FEATURE_GYRO_CAL;
  dmp_enable_feature(hal.dmp_features);
  dmp_set_fifo_rate(DEFAULT_MPU_HZ);
  mpu_set_dmp_state(1);
  hal.dmp_on = 1;
  //handle_input('8');
  //handle_input('9');
  handle_input('5');
  handle_input('.');
  for(;;){
    unsigned long sensor_timestamp;
    int new_data = 0;
    message rx;
    //    if (USART_GetITStatus(USART2, USART_IT_RXNE)) {
    /// if(pdPASS == (xQueueReceive(imuQueueHandle, &rx, 10))){
    /* A byte has been received via USART. See handle_input for a list of
     * valid commands.
     */
    //USART_ClearITPendingBit(USART2, USART_IT_RXNE);
    //handle_input(rx.messageUser.type);
    //}
    get_tick_count(&timestamp);
    //HAL_UART_Transmit(&huart1, "hola mundo\n", 11, 100);
	
#ifdef COMPASS_ENABLED
    /* We're not using a data ready interrupt for the compass, so we'll
     * make our compass reads timer-based instead.
     */
    if ((timestamp > hal.next_compass_ms) && !hal.lp_accel_mode &&
	hal.new_gyro && (hal.sensors & COMPASS_ON)) {
      hal.next_compass_ms = timestamp + COMPASS_READ_MS;
      new_compass = 1;
    }
#endif
    /* Temperature data doesn't need to be read with every gyro sample.
     * Let's make them timer-based like the compass reads.
     */
    if (timestamp > hal.next_temp_ms) {
      hal.next_temp_ms = timestamp + TEMP_READ_MS;
      new_temp = 1;
    }

    if (hal.motion_int_mode) {
      /* Enable motion interrupt. */
      mpu_lp_motion_interrupt(500, 1, 5);
      /* Notify the MPL that contiguity was broken. */
      inv_accel_was_turned_off();
      inv_gyro_was_turned_off();
      inv_compass_was_turned_off();
      inv_quaternion_sensor_was_turned_off();
      /* Wait for the MPU interrupt. */
      while (!hal.new_gyro) {}
      /* Restore the previous sensor configuration. */
      mpu_lp_motion_interrupt(0, 0, 0);
      hal.motion_int_mode = 0;
    }

